# GeometryObject Properties

---
The GeometryObject type exposes the following members.
| Name| Description
---|---|---
| GraphicsStyleId| The ElementId of the GeometryObject's GraphicsStyle
| Id| A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
| IsElementGeometry| Indicates whether this geometry is obtained directly from an Element.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Visibility| The visibility.
Top
#### Reference
GeometryObject Class
Autodesk.Revit.DB Namespace